select A.КодПоставщика, A.Категория, sum (СуммаПродаж) СуммаПродаж, sum (СуммаПоставки) СуммаПоставки from (
select Поставщики.КодПоставщика, Типы.Категория, Товары.КодТовара,
 (Заказано.Цена*Заказано.Количество) СуммаПродаж, (Товары.НаСкладе*Товары.Цена) СуммаПоставки from Поставщики
left Join Товары
on Товары.КодПоставщика = Поставщики.КодПоставщика 
left Join Типы
on Типы.КодТипа = Товары.КодТипа 
left Join Заказано
on Заказано.КодТовара = Товары.КодТовара) as A
group by A.КодПоставщика, A.Категория
order by A.КодПоставщика